# QUIZ P2 Cours 2
## 1. Import fichier csv

In [20]:
import pandas as pd
import numpy as np

df = pd.read_csv("course_quiz_p2.csv")
df.head()

   Position Sexe     Temps  Dept  Temps_secondes   Age
0         1    M  00:32:23    76          779543  40.0
1         2    M  00:32:40    27          779560  34.0
2         3    M  00:33:15    76          779595  44.0
3         4    M  00:33:23    76          779603  46.0
4         5    M  00:33:29    76          779609  26.0

In [35]:
df.shape

(340, 6)

In [21]:
df['Dept'].unique()

array([76, 27, 14, 78], dtype=int64)

In [22]:
df.isnull().sum()

Position          0
Sexe              2
Temps             0
Dept              0
Temps_secondes    0
Age               4
dtype: int64

In [23]:
df.dtypes

Position            int64
Sexe               object
Temps              object
Dept                int64
Temps_secondes      int64
Age               float64
dtype: object

In [26]:
df.loc[250, :]

Position               251
Sexe                     M
Temps             54min47s
Dept                    27
Temps_secondes      780887
Age                   42.0
Name: 250, dtype: object

In [27]:
df['Temps'] = pd.to_datetime(df['Temps'], format="%H:%M:%S", errors="coerce")

In [28]:
df.head()

   Position Sexe               Temps  Dept  Temps_secondes   Age
0         1    M 1900-01-01 00:32:23    76          779543  40.0
1         2    M 1900-01-01 00:32:40    27          779560  34.0
2         3    M 1900-01-01 00:33:15    76          779595  44.0
3         4    M 1900-01-01 00:33:23    76          779603  46.0
4         5    M 1900-01-01 00:33:29    76          779609  26.0

In [29]:
df.loc[df['Temps'].isnull(), :]

     Position Sexe Temps  Dept  Temps_secondes   Age
250       251    M   NaT    27          780887  42.0

In [30]:
df.describe()

          Position        Dept  Temps_secondes         Age
count   340.000000  340.000000      340.000000  336.000000
mean    177.061765   56.991176   780553.123529   42.145833
std     166.584054   25.059279      514.526264   13.963690
min    -100.000000   14.000000   779543.000000   18.000000
25%      85.750000   27.000000   780200.500000   34.000000
50%     170.500000   76.000000   780536.500000   41.500000
75%     255.250000   76.000000   780906.500000   49.250000
max    2640.000000   78.000000   781831.000000  174.000000

In [34]:
df.loc[df['Position'] < 0, :]

    Position Sexe               Temps  Dept  Temps_secondes   Age
43      -100    M 1900-01-01 00:39:39    27          779979  31.0

In [36]:
df.loc[df['Position'] > 340, :]

     Position Sexe               Temps  Dept  Temps_secondes   Age
264      2640    M 1900-01-01 00:56:21    76          780981  51.0

In [37]:
df.loc[df['Age'] > 80, :]

     Position Sexe               Temps  Dept  Temps_secondes    Age
302       303    M 1900-01-01 01:00:04    76          781204  174.0

In [42]:
df.loc[df[['Position']].duplicated(keep=False), :]

Empty DataFrame
Columns: [Position, Sexe, Temps, Dept, Temps_secondes, Age]
Index: []

In [44]:
df['Sexe'].unique()

array(['M', 'F', 'O', nan], dtype=object)